<template>
<div>
    <h1>Бібліотека Vuex</h1>
    <h3>
        
Vuex - патерн управління станом + бібліотека для додатків на Vue.js. Він служить централізованим сховищем даних для всіх компонентів програми з правилами, що гарантують, що стан може бути змінено тільки передбачуваним чином.
Vuex допомагає керувати спільно використовуваних станом ціною привнесення нових концепцій і допоміжного коду. Компроміс, коли короткочасна продуктивність страждає на благо довгостроковій.
</h3>
</div>
</template>